
&НаКлиенте
АСИНХ Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//TODO: Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	НазваниеТовара = Ждать ВвестиСтрокуАсинх("", "Введите название товара");
	Если ПроверитьСуществованиеТовара(НазваниеТовара) Тогда
		ТекстСообщения = СтрШаблон("Товар %1 найден!", НазваниеТовара); 
	Иначе
		ТекстСообщения = СтрШаблон("Товар %1 не найден!", НазваниеТовара); 
	КонецЕсли;
	Сообщить(ТекстСообщения);
КонецПроцедуры


Функция ПроверитьСуществованиеТовара(НазваниеТовара)
	ТаблицаТоваров = Новый ТаблицаЗначений();
	ТаблицаТоваров.Колонки.Добавить("Название");
	ТаблицаТоваров.Колонки.Добавить("Цена");
	
	СтрокаТовара = ТаблицаТоваров.Добавить();
	СтрокаТовара.Название = "Гитара";
	СтрокаТовара.Цена = 1000;
	
	СтрокаТовара = ТаблицаТоваров.Добавить();
	СтрокаТовара.Название = "Микрофон";
	СтрокаТовара.Цена = 500;
	
	ТоварСуществует = Справочники.Товары.ПроверитьСуществованиеПоНазванию(НазваниеТовара);
	Возврат ТоварСуществует;
КонецФункции